tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "oven-sh/bun"
# Run your GitHub Actions locally
brew "act"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.7", link: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "google-chrome"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Collaboration platform for API development
cask "postman"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin11"
# Open-source code editor
cask "visual-studio-code"
vscode "adpyke.codesnap"
vscode "Angular.ng-template"
vscode "antfu.goto-alias"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "casualjim.gotemplate"
vscode "CelianRiboulet.webvalidator"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cpylua.language-postcss"
vscode "csstools.postcss"
vscode "d-koppenhagen.file-tree-to-text-generator"
vscode "DaGhostman.vs-treeview"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "janisdd.vscode-edit-csv"
vscode "jrebocho.vscode-random"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msyrus.go-doc"
vscode "mtxr.sqltools"
vscode "NativeScript.nativescript"
vscode "Nuxt.mdc"
vscode "Nuxtr.nuxtr-vscode"
vscode "ParallelsDesktop.parallels-desktop"
vscode "patbenatar.advanced-new-file"
vscode "PKief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "q.typescript-mono-repo-import-helper"
vscode "redhat.vscode-yaml"
vscode "shanoor.vscode-nginx"
vscode "sleistner.vscode-fileutils"
vscode "svelte.svelte-vscode"
vscode "toba.vsfire"
vscode "unifiedjs.vscode-mdx"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.JavaScriptSnippets"
vscode "xdebug.php-debug"
vscode "zh9528.file-size"
vscode "ZixuanChen.vitest-explorer"
